src/base/InformationRegisters/ДевБаттл_Результаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДевБаттл_Результаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотраченоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРаунда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/base/InformationRegisters/ДевБаттл_СписокЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДевБаттл_СписокЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИТК_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаЗадачу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсрочка</Name>
					<Comment>Время на ознакомление с задачей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРаунда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/base/InformationRegisters/ДевБаттл_ТекущееСостояниеИгрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДевБаттл_ТекущееСостояниеИгрока</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДевБаттл_СостояниеИгрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/base/Enums/ДевБаттл_СостояниеИгрока.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ДевБаттл_СостояниеИгрока</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоИгры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоРаунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспытаниеОдиночное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспытаниеОдновременное</Name>
					<Comment>Испытание выполняется одновременно всеми</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецИгры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытанияВыполнено</Name>
					<Comment>Устанавливается ведущим</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИспытанияПровалено</Name>
					<Comment>Устанавливается ведущим</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/base/CommonModules/ДевБаттл_РаботаИгрока/Ext/Module.bsl
Функция ИтогиИгры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДевБаттл_Результаты.Игрок КАК Игрок,
		|	СУММА(ВЫБОР
		|			КОГДА ДевБаттл_Результаты.Выполнено
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Баллы
		|ИЗ
		|	РегистрСведений.ДевБаттл_Результаты КАК ДевБаттл_Результаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДевБаттл_Результаты.Игрок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Баллы УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Баллы = Новый Массив;
		Баллы.Добавить(0);
		Баллы.Добавить(0);
		Результат = НовыйРезультатИгры(Баллы, "Ведущий");
		
	Иначе                                                    
		
		ТаблицаРезультаты = РезультатЗапроса.Выгрузить();
		
		Если ТаблицаРезультаты[0].Баллы = ТаблицаРезультаты[1].Баллы Тогда
			
			Победитель = "Ничья";
			
		Иначе
			
			Победитель = ТаблицаРезультаты[0].Игрок;
			
		КонецЕсли;
		
		
		Результат = НовыйРезультатИгры(ТаблицаРезультаты.ВыгрузитьКолонку("Баллы")
										, Победитель);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйРезультатИгры(Баллы, Победитель)
	
	Результат = Новый Структура;
	Счет = "";                  
	Разделитель = "";
	Для Каждого Балл Из Баллы Цикл

		Счет = Счет + Разделитель + Строка(Балл);
		Разделитель = " : ";
		
	КонецЦикла;
		
	Результат.Вставить("Счет", Счет);
	Результат.Вставить("Победитель", Победитель);
	
	Возврат Результат;
	
КонецФункции

Функция ЗадачаИгрока() Экспорт
	
	// Получить задачу раунда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДевБаттл_СписокЗаданий.Задача КАК Задача,
		|	ЕСТЬNULL(ДевБаттл_Результаты.ПотраченоВремени, ДевБаттл_СписокЗаданий.ВремяНаЗадачу) КАК ВремяНаЗадачу,
		|	ДевБаттл_СписокЗаданий.Отсрочка КАК Отсрочка
		|ИЗ
		|	РегистрСведений.ДевБаттл_СписокЗаданий КАК ДевБаттл_СписокЗаданий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДевБаттл_Результаты КАК ДевБаттл_Результаты
		|		ПО ДевБаттл_СписокЗаданий.Игрок <> ДевБаттл_Результаты.Игрок
		|			И ДевБаттл_СписокЗаданий.НомерРаунда = ДевБаттл_Результаты.НомерРаунда
		|			И (ДевБаттл_Результаты.Выполнено)
		|ГДЕ
		|	ДевБаттл_СписокЗаданий.Игрок = &Игрок
		|	И ДевБаттл_СписокЗаданий.НомерРаунда = &НомерРаунда";
	
	Запрос.УстановитьПараметр("Игрок",			ПараметрыСеанса.ИмяПользователя);
	Запрос.УстановитьПараметр("НомерРаунда",	Константы.ДевБаттл_Раунд.Получить());	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ВызватьИсключение "Не удалось получить задачу раунда";
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = НовыйЗадачиИгрока(Выборка.Задача, Выборка.ВремяНаЗадачу, Выборка.Отсрочка);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйЗадачиИгрока(Задача, ВремяНаЗадачу, Отсрочка)
	
	Возврат Новый Структура("Задача, ВремяНаЗадачу, Отсрочка"
								, Задача
								, ВремяНаЗадачу
								, Отсрочка);
	
КонецФункции

Процедура ИспытаниеОкончено(Выполнено, ПотраченоВремени = 0) Экспорт
	
	ИмяИгрока = ПараметрыСеанса.ИмяПользователя;
	
	ДевБаттл_ОбщегоНазначенияВызовСервера.ЗафиксироватьРезультатИспытания(ИмяИгрока
																		, Выполнено
																		, ПотраченоВремени);
	
КонецПроцедуры
																	
Функция ТекущееСостояние() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДевБаттл_ТекущееСостояниеИгрока.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ДевБаттл_ТекущееСостояниеИгрока КАК ДевБаттл_ТекущееСостояниеИгрока
		|ГДЕ
		|	ДевБаттл_ТекущееСостояниеИгрока.Игрок = &Игрок";
	
	Запрос.УстановитьПараметр("Игрок", ПараметрыСеанса.ИмяПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();                                                    
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Состояние = Перечисления.ДевБаттл_СостояниеИгрока.НачалоИгры;
		
	Иначе
		
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
		Состояние = ВыборкаДетальныеЗаписи.Состояние;
		
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Функция ЕстьИгрокиЗавершившиеРаунд() Экспорт
	
	НомерРаунда = Константы.ДевБаттл_Раунд.Получить();
	Игрок = ПараметрыСеанса.ИмяПользователя;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДевБаттл_Результаты.Игрок КАК Игрок,
		|	ДевБаттл_Результаты.НомерРаунда КАК НомерРаунда,
		|	ДевБаттл_Результаты.Выполнено КАК Выполнено
		|ИЗ
		|	РегистрСведений.ДевБаттл_Результаты КАК ДевБаттл_Результаты
		|ГДЕ
		|	ДевБаттл_Результаты.НомерРаунда = &НомерРаунда
		|	И ДевБаттл_Результаты.Выполнено
		|	И ДевБаттл_Результаты.Игрок <> &Игрок";
	
	Запрос.УстановитьПараметр("НомерРаунда", НомерРаунда);
	Запрос.УстановитьПараметр("Игрок", Игрок);
	
	РезультатЗапроса = Запрос.Выполнить();                                                    
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
